Спортклуб/src/Documents/ПродажаАбонемента/ПродажаАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаАбонемента</name>
  <registerRecords>AccumulationRegister.УчетПосещаемости</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиТренеров</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>КлубнаяКарта</name>
    <type>
      <types>CatalogRef.КлубныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАбонемента</name>
    <type>
      <types>CatalogRef.ВидыАбонементов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Абонементы</name>
    <attributes>
      <name>КоличествоПосещений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграниченаДлительность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МесяцевДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Групповой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ГруппыСпортсменов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноеКоличествоЗаморозок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Спортклуб/src/InformationRegisters/ЦенаАбонемента/ЦенаАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦенаАбонемента</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидАбонемента</name>
    <type>
      <types>CatalogRef.ВидыАбонементов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Спортклуб/src/InformationRegisters/ЦеныУслуг/ЦеныУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Спортклуб/src/Documents/Оплата/Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Оплата</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаАбонемента</types>
      <types>DocumentRef.ПродажаТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Абонемент</name>
      <type>
        <types>CatalogRef.Товары</types>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Спортклуб/src/Catalogs/ВидыАбонементов/ВидыАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыАбонементов</name>
  <attributes>
    <name>ОграничениеДлительности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьЗаморозки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАбонемента</name>
    <type>
      <types>EnumRef.ТипыАбонементов</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугаАбонемента</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
</mdclass:Catalog>

Спортклуб/src/Documents/ПродажаАбонемента/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПолучитьИнфуОбАбонементе(СсылкаАбонемент)
	Результат = Новый Структура(
        "ДлительностьДней, ДлительностьМесяцев, КоличествоПосещений, Сумма, Услуга, ОграничениеДлительности"
    );
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыАбонементов.ОграничениеДлительности КАК ОграничениеДлительности,
		|	ВидыАбонементов.ДлительностьДней КАК ДлительностьДней,
		|	ВидыАбонементов.ДлительностьМесяцев КАК ДлительностьМесяцев,
		|	ВидыАбонементов.ВозможностьЗаморозки КАК ВозможностьЗаморозки,
		|	ВидыАбонементов.КоличествоПосещений КАК КоличествоПосещений,
		|	ВидыАбонементов.УслугаАбонемента КАК УслугаАбонемента,
		|	ЦенаАбонемента.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦенаАбонемента КАК ЦенаАбонемента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыАбонементов КАК ВидыАбонементов
		|		ПО ЦенаАбонемента.ВидАбонемента = ВидыАбонементов.Ссылка
		|ГДЕ
		|	ВидыАбонементов.Ссылка = &Ссылка
		|	И ЦенаАбонемента.ВидАбонемента = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", СсылкаАбонемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.ДлительностьДней = ВыборкаДетальныеЗаписи.ДлительностьДней;
		Результат.ДлительностьМесяцев = ВыборкаДетальныеЗаписи.ДлительностьМесяцев;
		Результат.КоличествоПосещений = ВыборкаДетальныеЗаписи.КоличествоПосещений;
		Результат.Сумма = ВыборкаДетальныеЗаписи.Цена;
		Результат.Услуга = ВыборкаДетальныеЗаписи.УслугаАбонемента;
		Результат.ОграничениеДлительности = ВыборкаДетальныеЗаписи.ОграничениеДлительности;
	КонецЦикла;

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ВидАбонементаПриИзменении(Элемент)
	СсылкаАбонемент = Объект.ВидАбонемента;
	Данные = ПолучитьИнфуОбАбонементе(СсылкаАбонемент);
	
	Стр = Объект.Абонементы.Добавить();

    Стр.ДнейДлительность = Данные.ДлительностьДней;
    Стр.МесяцевДлительность = Данные.ДлительностьМесяцев;
    Стр.КоличествоПосещений = Данные.КоличествоПосещений;
    Стр.Сумма = Данные.Сумма;
    Стр.Услуга = Данные.Услуга;
    Стр.ОграниченаДлительность= Данные.ОграничениеДлительности;

КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьКартуПоСпортсмену(СсылкаНаСпортсмена)
    Если СсылкаНаСпортсмена = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ ПЕРВЫЕ 1
         |    КлубныеКарты.Ссылка КАК Карта,
         |    КлубныеКарты.Наименование КАК Название
         |ИЗ
         |    Справочник.КлубныеКарты КАК КлубныеКарты
         |ГДЕ
         |    КлубныеКарты.ВладелецКарты = &Спортсмен
         |    И НЕ КлубныеКарты.ПометкаУдаления";

    Запрос.УстановитьПараметр("Спортсмен", СсылкаНаСпортсмена);

    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Карта;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
КонецФункции


&НаКлиенте
Процедура СпортсменПриИзменении(Элемент)
    Объект.КлубнаяКарта = ПолучитьКартуПоСпортсмену(Объект.Спортсмен);
КонецПроцедуры


// Работа с ценами
&НаСервереБезКонтекста
Функция ПолучитьЦеныУслуг(МассивУслуг)

    Если МассивУслуг.Количество() = 0 Тогда
        Возврат Новый Соответствие;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
         |    ЦеныУслуг.Услуга КАК Услуга,
         |    МАКСИМУМ(ЦеныУслуг.Цена) КАК Цена
         |ИЗ
         |    РегистрСведений.ЦеныУслуг КАК ЦеныУслуг
         |ГДЕ
         |    ЦеныУслуг.Услуга В (&Услуги)
         |    И ЦеныУслуг.Период <= &Период
         |СГРУППИРОВАТЬ ПО
         |    ЦеныУслуг.Услуга";

    Запрос.УстановитьПараметр("Услуги", МассивУслуг);
    Запрос.УстановитьПараметр("Период", ТекущаяДата());

    Результат = Запрос.Выполнить().Выгрузить();

    Цены = Новый Соответствие;
    Для Каждого Стр Из Результат Цикл
        Цены.Вставить(Стр.Услуга, Стр.Цена);
    КонецЦикла;

    Возврат Цены;
КонецФункции

&НаКлиенте
Процедура ПересчитатьСтрокуАбонемента(Строка, Цены)
    Если Строка = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Количество = ?(Строка.КоличествоПосещений = Неопределено, 0, Строка.КоличествоПосещений);
    ЦенаОдного = Цены.Получить(Строка.Услуга); 
    Если ЦенаОдного = Неопределено Тогда
        ЦенаОдного = 0;
    КонецЕсли;

    Строка.Сумма = Количество * ЦенаОдного;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВсеАбонементы()

    Услуги = Новый Массив;
    Для Каждого Строка Из Объект.Абонементы Цикл
        Если ЗначениеЗаполнено(Строка.Услуга) Тогда
            Услуги.Добавить(Строка.Услуга);
        КонецЕсли;
    КонецЦикла;

    Цены = ПолучитьЦеныУслуг(Услуги);

    Для Каждого Строка Из Объект.Абонементы Цикл
        ПересчитатьСтрокуАбонемента(Строка, Цены);
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура АбонементыУслугаПриИзменении(Элемент)
    ПересчитатьВсеАбонементы();
КонецПроцедуры

&НаКлиенте
Процедура АбонементыКоличествоПосещенийПриИзменении(Элемент)
    ПересчитатьВсеАбонементы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ПересчитатьВсеАбонементы();
КонецПроцедуры






&НаКлиенте
Процедура Оплатить(Команда)
    Если Не Объект.Проведен Тогда
        ПоказатьПредупреждение(, "Документ должен быть проведен перед оплатой");
        Возврат;
    КонецЕсли;
    ОткрытьФормуОплаты();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОплаты()
    ПараметрыФормы = Новый Структура; 
    ПараметрыФормы.Вставить("Основание", Объект.Ссылка); //Ссылка на текущий документ продажи
    ОткрытьФорму("Документ.Оплата.Форма.ФормаДокумента", ПараметрыФормы);    
КонецПроцедуры
